token = '1573785176:AAFNSmH1NUsrOYGYF64tQLsACC6XqLo5pa0'

# отправка email
port = 465
smtp_server = 'smtp.yandex.ru'
sender_email = 'orthodental@tut.by'
password = '05082018'

clinics = {
    'clinic1': {
        'location': '23.10408310940211,113.33599550076433',
        'dates_available': {'20/10/2021': ['10.00', '10.30'], '23/10/2021': ['13.00', '13.30']}
    },
    'clinic2': {
        'location': '23.094668571580023,113.2990937990103',
        'dates_available': {'20/10/2021': ['10.00', '10.30'], '23/10/2021': ['13.00', '13.30']}
    },
    'clinic3': {
        'location': '23.122802697485273,113.37896376080867',
        'dates_available': {'20/10/2021': ['10.00', '10.30'], '23/10/2021': ['13.00', '13.30']}
    },
    'clinic4': {
        'location': '23.106391840540557, 113.24301488782017',
        'dates_available': {'20/10/2021': ['10.00', '10.30'], '23/10/2021': ['13.00', '13.30']}
    },
}


